Revit 2027 API
BendingDetailCustomFieldProperties.SegmentLengthDimensionsForHooksEnabled Property
 Identifies if segment length dimensions for hooks will be shown or not. If this property is true, the SegmentLengthDimensionsEnabled should also be true to see segment length dimensions for hooks.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SegmentLengthDimensionsForHooksEnabled { get; set; }
Public Property SegmentLengthDimensionsForHooksEnabled As Boolean
	Get
	Set
public:
property bool SegmentLengthDimensionsForHooksEnabled {
	bool get ();
	void set (bool value);
}
member SegmentLengthDimensionsForHooksEnabled : bool with get, set
Property Value
Boolean
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace